In [61]:
import pandas as pd
import pandas_datareader.data as web
import datetime as dt

In [62]:
#Create your time range (start and end variables). The start date should be 01/01/2015 and the end should today (whatever your today is)
start = dt.date(2015,1,1)
end = dt.date.today()

In [63]:
#Select the Apple, Tesla, Twitter, IBM, LinkedIn stocks symbols and assign them to a variable called stocks
stocks = ['AAPL','TSLA', 'IBM', 'LNKD']

In [64]:
#Read the data from google, assign to df and print it
df = data.DataReader(stocks, 'morningstar', start, end)
df.head()

                    Close    High      Low    Open    Volume
Symbol Date
AAPL   2015-01-01  110.38  110.38  110.380  110.38         0
       2015-01-02  109.33  111.44  107.350  111.39  53204626
       2015-01-05  106.25  108.65  105.410  108.29  64285490
       2015-01-06  106.26  107.43  104.630  106.54  65797116
       2015-01-07  107.75  108.20  106.695  107.20  40105934

In [65]:
type(df)

pandas.core.frame.DataFrame

In [66]:
#Create a dataFrame called vol, with the Volume values.
vol = pd.DataFrame(df.Volume)
vol.head()

                     Volume
Symbol Date
AAPL   2015-01-01         0
       2015-01-02  53204626
       2015-01-05  64285490
       2015-01-06  65797116
       2015-01-07  40105934

In [67]:
vol = df.Volume.unstack(level=0)
vol.head()

Symbol          AAPL      IBM     LNKD     TSLA
Date
2015-01-01         0        0        0        0
2015-01-02  53204626  5525466  1203743  4764443
2015-01-05  64285490  4880389  1400562  5368477
2015-01-06  65797116  6146712  2006546  6261936
2015-01-07  40105934  4701839   985016  2968390

In [68]:
#Aggregate the data of Volume to weekly
vol['week'] = vol.index.week
vol['year'] = vol.index.year
vol.groupby(['week','year']).sum().head()

Symbol          AAPL       IBM     LNKD      TSLA
week year
1    2015   53204626   5525466  1203743   4764443
     2016  343790211  25252981  6634960  20975335
     2017  103845468  11943268        0  28576313
     2018  101168448  26396083        0  23411252
2    2015  283252614  24458400  7203125  22709607

In [69]:
vol['year'] = vol.index.year
voly = vol.groupby('year').sum()
type(voly)

pandas.core.frame.DataFrame

In [70]:
voly.head()

Symbol         AAPL         IBM       LNKD        TSLA  week
year
2015    13068421446  1105584799  441128979  1088281586  7099
2016     9686186610  1019174936  569878287  1162408261  6943
2017     6811471285  1070968835          0  1590067848  6890
2018     2888464812   456971122          0   572465969   748

In [71]:
voly[voly.index == 2015]

Symbol         AAPL         IBM       LNKD        TSLA  week
year
2015    13068421446  1105584799  441128979  1088281586  7099